Revit 2026 API

# VendorIdAttribute Properties

---

The VendorIdAttribute type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | TypeId | When implemented in a derived class, gets a unique identifier for this Attribute.(Inherited from Attribute) |
|  | Value | AddInId VendorId value. |

#### Reference

VendorIdAttribute Class

Autodesk.Revit.DB.Macros Namespace